app/controllers/api/v1/groups_controller.rb

SELECT "user_groups".* FROM "user_groups" WHERE "user_groups"."group_id" = $1  [["group_id", 1]]
---
   def index
     @groups = Group.all